---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LightGroupManager
source: html/46515a1f-01c8-935d-2e42-dc57452d4eb9.htm
---
# Autodesk.Revit.DB.Lighting.LightGroupManager

This class represents a set of light groups that are used for easier management of various lighting scenarios

## Syntax (C#)
```csharp
public class LightGroupManager : IDisposable
```